app/controllers/charges_controller.rb

SELECT "users".* FROM "users"
SELECT "events".* FROM "events"
---
  def show
    @all_u = User.all
    @event_id = params[:id].to_i
    @@event_id_to = @event_id
    @all_e = Event.all

INSERT INTO "attendances" ("user_id", "event_id", "strip_custumer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["event_id", 1], ["strip_custumer_id", "cus_EcLUa00Zk9tKJh"], ["created_at", "2019-03-01 08:32:54.660582"], ["updated_at", "2019-03-01 08:32:54.660582"]]
---
  def create
      # Amount in cents
      @amount = 500

      customer = Stripe::Customer.create({
        email: params[:stripeEmail],
        source: params[:stripeToken],
      })

      charge = Stripe::Charge.create(
        customer: customer.id,
        amount: @amount,
        description: 'Rails Stripe customer',
        currency: 'usd',
      )

      @a = Attendance.create(user_id: current_user.id, event_id: @@event_id_to, strip_custumer_id: customer.id)