app/controllers/event_controller.rb

  def index
    @all_e = Event.all
---
SELECT "events".* FROM "events"

  def create
    @user = User.find(current_user.id)
    @id_current_user = current_user.id
    event = Event.create(title: params[:title], description: params[:description], location: params[:location], start_date: params[:start_date], duration: params[:duration], price: params[:price], user_id: @id_current_user)
    @user.events << event
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "events" ("title", "description", "location", "start_date", "duration", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def show
    @all_u = User.all
    @event_id = params[:id].to_i
    @@event_id_to = @event_id
    @all_e = Event.all
---
SELECT "users".* FROM "users"
SELECT "events".* FROM "events"